export const faqTitle = ["무엇을 도와 드릴까요?", "바다를 위한 기부 플랫폼, NFT와 함께하는 푸르게입니다."];

export const startPurgaeMenuTitle = ["지갑 생성하기", "이더리움 받기"];

export const startPurgaeMenuSubTitle = [
  "푸르게를 이용하기 위해서는 지갑이 필요해요!",
  "이더리움을 받는 방법을 알려드려요!",
];

export const findOutTitle = ["지갑 연결 및 끊기", "수수료 알아보기", "푸르게 NFT 확인하기"];

export const findOutSubTitle = [
  "지갑을 생성하셨다면, 한번 연결해 볼까요?",
  "서비스 및 제작자 수수료는 얼마인가요?",
  "내가 뽑은 NFT를 확인해 보아요!",
];

export const nftMenuTitle = ["NFT가 뭔가요?", "지갑이 뭔가요?", "가스가 뭔가요?", "블록체인이 뭔가요?"];

export const nftMenuSubTitle = [
  "대체 불가능 토큰.. 그게 대체 뭔데?!",
  "지갑이 뭔가요? 그게 꼭 필요해요?",
  "가스가 뭐길래 자꾸 가스비가 든다는 건가요?",
  "왜 블록체인을 사용하는 건가요?",
];

export const WhatIsNft = [
  "NFT란 Non-Fungiable Token의 약자로, \n 대체 불가능한 토큰을 말해요.",
  "??? 그게 대체 무슨 말이죠?",
  "예를 들어, 어렸을 적에  \n 띠부띠부씰이 들어있는 빵을 먹어본 적이 있나요? \n 빵 안에 들어있는 띠부씰이 두 번 똑같은 게 나오면 \n 괜히 실망스럽기도 하고 그랬죠. \n \n 친구와 띠부씰을 교환하려고 해도, \n 그 친구와 내가 똑같은 띠부씰을 가지고 있다면 \n 서로 같은 가치를 가지고 있기 때문에 교환의 의미가 없었죠. \n  \n 하지만 내가 뽑은 띠부씰이 NFT라면 어떨까요? \n 세상에 중복되는 띠부씰은 단 하나도 없을 거에요. \n 만일 생긴 게 똑같더라도, 일련번호나 제조일자 등으로 \n 완전히 고유한 값을 부여해 주어야 하죠. \n  \n 그렇게 띠부씰 하나하나는 유일한 존재가 되고, \n 대체 불가능한 띠부씰이 됩니다. \n  \n 푸르게의 NFT도 마찬가지에요. \n 모든 해양생물 NFT가 다 다르게 생겼답니다! \n 이제 똑같은 게 뽑힐 걱정은 안 할 수 있겠죠? \n 이렇게 NFT는 각자 고유한 가치를 지니기 때문에, \n 다른 것으로 대체할 수 없는 토큰이 될 수 있어요!",
  "오잉? 토큰은 또 뭔가요?",
  "토큰은 블록체인 세계의 화폐랍니다! \n 게임을 할 때 게임머니가 있듯이, \n 블록체인 세계에서 통용되는 화폐가 토큰이에요.",
  "그렇다면 NFT는 대체 불가능한 블록체인 세계의 \n 화폐라고 생각하면 되겠네요!",
];

export const WhatIsWallet = [
  "지갑은 개인 키(Private Key)에요.",
  "...? 개인 키가 뭔가요?",
  "암호화폐, NFT 등의 가상 자산을 보관, 전달, 거래하려면 \n 온라인 상에 일종의 전자 지갑이 필요해요. \n 내가 구매한 가상 자산을 보관하는 곳도, \n 다른 주소로 전송하고 결제하는 것도 \n 모두 가상 지갑을 통해서 이뤄지죠. \n  \n 각각의 지갑은 고유한 나만의 주소가 있어요. \n 이 주소를 공개 키(Public key)라고 하는데요, \n 은행에서 계좌를 개설하고 번호를 부여받듯이, \n 지갑을 개설하면 ‘0x’로 시작하는 지갑 주소를 받아요. \n 백문이 불여일견, \n 지갑 생성하기를 참고해서 지갑을 만들어 보세요! \n  \n 개인 키는 서명이라고 생각하면 쉬워요. \n 현실에서는 문서나 계약을 할 때 서명을 하게 되는데, \n 블록체인에서도 이 서명을 하기 위해서 \n 지갑, 즉 개인 키를 사용하는 거랍니다!",
  "지갑을 만들었더니 단어 12개를 줬어요! 이건 뭔가요?",
  "그건 시드 문구(seed phrase)라고 해요. \n 개인 키와 지갑을 찾을 때 반드시 필요한 거니까, \n 아무도 모르는 곳에 꽁꽁 숨겨서 꼭 기록해두세요!!",
  "와! 드디어 저도 지갑이 생겼네요!!",
];

export const WhatIsGas = [
  "이더리움 가스는 스마트 컨트랙트를 실행하기 위한 \n 계산 비용을 측정하는 단위에요.",
  "너무 어려운 말이에요..",
  "좀 더 쉽게 설명하자면, \n 이더리움 플랫폼을 실행시키기 위해서 들어가는 \n 연료라고 생각하면 돼요! \n  \n 이더리움 네트워크에서 수행하는 모든 것은 \n 가스 비용이라는 것이 발생하고, \n 가스는 ETH로 전환되어요. \n  \n 컨트랙트의 복잡한 정도나, \n 완료되는 속도에 따라서 가스 비용이 달라지죠.",
  "엥? 차도 아닌데 연료가 들어가요?",
  "이더리움이 가스를 사용하는 이유에는 여러 가지가 있어요. \n 가장 큰 이유 중 하나는, \n 이더리움 플랫폼은 아무나 다 사용할 수 있기 때문에 \n 무료로 사용하게 된다면 \n 공유지의 비극이 일어날 수 있기 때문이에요. \n  \n 무료 공공장소에서 사람들의 무질서로 인해서 \n 공공시설, 장소가 더럽혀지는 것을 본 적이 있나요 \n 블록체인에서는 그것을 막기 위해서 \n 반복문을 사용하는 것을 금지하고 있지만, \n 이더리움은 반복문을 허용하는 대신에 \n 가스를 도입하게 되었죠.",
  "아하! 그러면 가스는 이더리움 플랫폼의 \n 사용료라고 생각하면 되겠네요!",
];

export const WhatIsBlockChain = [
  "블록체인이란 분산 컴퓨팅 기술 기반의 \n 데이터 위변조 방지 기술이에요.",
  "으악 그게 대체 무슨 말이에요",
  "혹시 은행에 적금을 넣어 본 적이 있나요? \n 그렇다면, 적금을 잃어버린 적은요? \n  \n 적금을 잃어버린다는게 무슨 말인가 싶겠지만, \n 은행의 모든 데이터가 사라져 버린다면 \n 우리가 얼마나 적금을 넣었는지도 영영 알 수 없게 되겠죠. \n  \n 이것을 막기 위해 등장한 것이 비트코인과 블록체인이에요. \n  \n 한 마을이 있다고 생각해 보아요. \n 마을 안에 사는 사람들에게 노트가 하나씩 있는데, \n 마을 사람들 사이에서 돈 거래가 일어날 때마다 \n 모든 마을 사람들의 노트에 그 거래내역이 적힌다면, \n 한 사람의 노트가 사라진다고 하더라도 \n 다른 사람들의 노트가 남아 있는 한 \n 거래내역을 잃어버릴 일은 없겠죠? \n  \n 여기서 블록이 노트라고 생각하면 돼요. \n 블록에다가 내용을 채운 다음에, \n 모든 블록이 차면 새로운 블록을 그 위에 쌓아요. \n 그리고 체인을 통해서 그걸 연결해요. \n 그래서 블록체인이라고 부른답니다.",
  "음.. 그게 왜 안전하고 좋은 방법인지 아직 잘 모르겠어요.",
  "기존의 은행이 고수하던 방식은 \n 보안을 위해서 장부를 꽁꽁 숨기는 것이었어요. \n  \n 하지만 블록체인은 장부를 모두가 가지고 있게 됨으로써 \n 오히려 조작하기 더 어렵게 만들었죠. \n  \n 10명, 100명의 사람만 가지고 있는 것이 아니라 \n 수만 명의 사람이 장부를 가지고 있다면, \n 장부를 조작하는 것은 불가능에 가깝겠죠. \n 이것을  공공 거래 장부라고도 불러요. \n  \n 그렇기 때문에 블록체인은 \n 결코 해킹 당할 수 없는 기술이라고 표현되기도 해요.",
];
